<?php

namespace Database\Seeders;

use App\Models\Worker;
use Illuminate\Database\Seeder;

class WorkersSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $workers = [
            [
                "name" => "Поцко С.С.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Карелина С.Н.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Новикова К.Ю.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Бойцова М.В.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Иванова М.Л.",
                "job" => "Мастер смены",
                "category" => null,

            ],
            [
                "name" => "Немакова С.Н.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Дмитриев Д.С.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Фасхиев А.А.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Михеенков А.Э.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Кутлухузин П.Р.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Филькин А.С.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Михеенков Э.Е.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Шихаев Р.Г.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Симонов А.И.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Качалин Н.А.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Щебетун И.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Безунов М.В.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Гладких С.М.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Кобач С.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Алексеев И.А.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Парахин Д.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Юркевич В.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Омельченко А.Е.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Киреев А.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Разиньков Д.И.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Харченко В.И.",
                "job" => "печатник",
                "category" => 2,
            ],
            [
                "name" => "Новичков Е.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Сульков Н.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Гизатулин А.Р.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Шмиголь Н.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Матюш В.Д.",
                "job" => "печатник",
                "category" => 5
            ],
            [
                "name" => "Разинкин А.И.",
                "job" => "печатник",
                "category" => 4
            ],
            [
                "name" => "Велигор Е.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Быстров Д.О.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Сергеев М.В.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Шулаев С.С.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Осокин А.Н.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Михневич А.И.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Козлов А.Л.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Федичев К.С.",
                "job" => "печатник",
                "category" => 4,
            ],
            [
                "name" => "Шагашев А.А.",
                "job" => "печатник",
                "category" => 5,
            ],
            [
                "name" => "Гафуров Исм.С.",
                "job" => "подсобный рабочий",
                "category" => null,
            ],
            [
                "name" => "Ходжиев Ш.",
                "job" => "печатник",
                "category" => 3,
            ],
            [
                "name" => "Декхонов Х.",
                "job" => "печатник",
                "category" => 3,
            ],
            [
                "name" => "Черкас С.Е.",
                "job" => "оператор ламинатора",
                "category" => 5,
            ],
            [
                "name" => "Козин А.О.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Баканов Д.В.",
                "job" => "оператор ламинатора",
                "category" => 5,
            ],
            [
                "name" => "Козлов С.С.",
                "job" => "оператор ламинатора",
                "category" => 4,
            ],
            [
                "name" => "Ахмедов Р.Р.",
                "job" => "оператор ламинатора",
                "category" => 5,
            ],
            [
                "name" => "Михайлов Д.А. ",
                "job" => "оператор ламинатора",
                "category" => 4,
            ],
            [
                "name" => "Савинов В.В.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Гафуров Ф.",
                "job" => "подсобный рабочий",
                "category" => null,
            ],
            [
                "name" => "Гафуров Исф.Ф.",
                "job" => "оператор ламинатора",
                "category" => null,
            ],
            [
                "name" => "Ларин М.В.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Белов А.И.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Ланглиц Е.А.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Торнев И.А.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Зюрин М.Д.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Рождественский М.А.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Самарский М.Н.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Загидулин Р.М.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Шведов А.Ю.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Кэнэцуй Д",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Зинченко Ю.А.",
                "job" => "Мастер смены",
                "category" => null,
            ],
            [
                "name" => "Давыдов В. А.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Гафуров М",
                "job" => "печатник",
                "category" => 3,
            ],
            [
                "name" => "Волков А.",
                "job" => "Наладчик",
                "category" => 4,
            ],
            [
                "name" => "Мартынов Д.",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Шакирзянов Д.С",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Рябиков А.В",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Цэрнэ С.А",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Цветков Е.А.",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Близнецов Ю.О.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Дроздовский А.Е.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Головченко К.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Быстров А.О.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Мишуков С.А.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Зинченко Д.",
                "job" => "Наладчик",
                "category" => 5,

            ],
            [
                "name" => "Климентенко С.А.",
                "job" => "Наладчик",
                "category" => 4,

            ],
            [
                "name" => "Ланглиц О.",
                "job" => "Наладчик",
                "category" => 4,

            ],
            [
                "name" => "Козырев А.А",
                "job" => "Наладчик",
                "category" => 4,
            ],
            [
                "name" => "Долженко И.В.",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Саитов Р.",
                "job" => "Наладчик",
                "category" => 4,
            ],
            [
                "name" => "Постричев Р.А.",
                "job" => "Наладчик",
                "category" => 5,
            ],
            [
                "name" => "Котельников М.В.",
                "job" => "Наладчик",
                "category" => 4,
            ],
            [
                "name" => "Александрович Н.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Варламчева О.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Егорова С.А.",
                "job" => "приёмщица",
                "category" => 3,
            ],
            [
                "name" => "Кузнецова Е.И.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Пулкки О.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Сиполайнен Е.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Солодкова С.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Белова Л.П.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Смирнова И.М.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Виноградова Н.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Иванова Н.И.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Рябикова Н.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Ульянова В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Цветкова Т.Д.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Стороженко О.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Войнолович Ю.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Дроздовская Н.Н",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Тенилина Е.М",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Гусева Д.О",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Лазарева Е.Д",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Рожнова Т.Н",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Сибилева Н.А",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Комлева Н.К.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Морозова Т.Ю.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Богданова Т.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Болдырева А.С.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Пермякова И.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Соловьёва Е.М.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Филиппова О.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Яковлева А.К.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Коноплёва Л.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Мандрыкина Ю.Н.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Ранченко А.Г.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Усердова Н.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Чургович Е.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Максимова И.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Евграфова М.Н.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Кириченко Д.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Зернова К.Т.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Шувалова Е.Г.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Макеева А.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Граблина М.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Шемякина Н.Л.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Шандыба Н.В.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Быстрова О.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Ершова Н.А.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Лощинина А.А",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Шагаева Т.",
                "job" => "приёмщица",
                "category" => 4,
            ],
            [
                "name" => "Тюрина В.Р.",
                "job" => "мастер смены",
                "category" => null,
            ],
            [
                "name" => "Буркова И.С.",
                "job" => "местер смены",
                "category" => null,
            ],
            [
                "name" => "Пальмина Н.Н.",
                "job" => "мастер смены",
                "category" => null,
            ],
            [
                "name" => "Шакирзянова Т.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Русских Е.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Мах И.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Артемова И.А.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Емцева А.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Тарасова Я.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Чучавикова А.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Сиверцева З.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Чарушникова М.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Хазова И.А.",
                "job" => "приёмщица",
                "category" => null,
            ],
            [
                "name" => "Ананьев Е.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Ефимова И.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Поцко В.М.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Волкова Ю.А.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Самуйлова Н.А.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Михайлик О.В.",
                "job" => "приемщица",
                "category" => null,
            ],
            [
                "name" => "Орех М.Н.",
                "job" => "печатник",
                "category" => null,
            ],
            [
                "name" => "Жимков Э.Л.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Гафуров Шахбоз",
                "job" => "подсобный рабочий",
                "category" => null,
            ],
            [
                "name" => "Бахронова Е.А.",
                "job" => "Мастер смены",
                "category" => 3
            ],


            [
                "name" => "Алексеев Д.В",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Обидов Наим Н.",
                "job" => "упаковщик",
                "category" => null,
            ],
            [
                "name" => "Ляхов Д.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Баходуров Н.Б.",
                "job" => "ученик",
                "category" => null,
            ],
            [
                "name" => "Асроров О.",
                "job" => "упаковщик",
                "category" => null,
            ],
            [
                "name" => "Обидов Наби Н.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Ходжиев А.",
                "job" => "упаковщик",
                "category" => null,
            ],
            [
                "name" => "Петров А.А",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Касимов А.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Раупов А.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Войналович В.Н.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Волков Н.С.",
                "job" => "упаковщик",
                "category" => null,
            ],
            [
                "name" => "Кривачев К.В.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
            [
                "name" => "Богачук А.В.",
                "job" => "упаковщик",
                "category" => null,
            ],
            [
                "name" => "Шарипов А.",
                "job" => "машинист резательных машин",
                "category" => null,
            ],
        ];

        Worker::factory()->createMany($workers);
    }
}
