<?php

return [
    [
        "id" => 1,
        "ask" => "Я думаю, что моя память сейчас лучше, чем была раньше.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 2,
        "ask" => "Я вполне мог бы жить один, вдали от людей.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 3,
        "ask" => "Если предположить, что небо находится \"внизу\" и что зимой \"жарко\", я должен был бы назвать преступника:",
        "answers" => [
            [
                "say" => "Бандитом",
                "raw_point" => 0
            ],
            [
                "say" => "Святым",
                "raw_point" => 1
            ],
            [
                "say" => "Тучей",
                "raw_point" => 0
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 4,
        "ask" => "Когда я ложусь спать, то:",
        "answers" => [
            [
                "say" => "Быстро засыпаю",
                "raw_point" => 2
            ],
            [
                "say" => "Когда как",
                "raw_point" => 1
            ],
            [
                "say" => "Засыпаю с трудом",
                "raw_point" => 0
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 5,
        "ask" => "Если бы я вел машину по дороге, где много других автомашин, я предпочел бы:",
        "answers" => [
            [
                "say" => "Пропустить вперед большинство машин",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Обогнать все идущие впереди машины",
                "raw_point" => 2
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 6,
        "ask" => "В компании я предоставляю возможность другим шутить и рассказывать всякие истории.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 7,
        "ask" => "Мне важно, чтобы во всем окружающем не было беспорядка.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 8,
        "ask" => "Большинство людей, с которыми я бываю в компаниях, несомненно, рады меня видеть.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 9,
        "ask" => "Мне больше нравятся:",
        "answers" => [
            [
                "say" => "Фигурное катание и балет",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Борьба и регби",
                "raw_point" => 0
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 10,
        "ask" => "Меня забавляет несоответствие между тем, что люди делают, и тем, что они потом рассказывают об этом.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 11,
        "ask" => "Читая о каком-либо происшествии, я интересуюсь всеми подробностями.",
        "answers" => [
            [
                "say" => "Всегда",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Редко",
                "raw_point" => 2
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 12,
        "ask" => "Когда друзья подшучивают надо мной, я смеюсь вместе со всеми и не обижаюсь.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 13,
        "ask" => "Если мне кто-нибудь нагрубит, я могу быстро забыть об этом.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 14,
        "ask" => "Мне больше нравится придумывать новые способы в выполнении какой-либо работы, чем придерживаться испытанных приемов.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 15,
        "ask" => "Когда я планирую что-нибудь, я предпочитаю делать это самостоятельно, без чьей-либо помощи.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 16,
        "ask" => "Думаю, что я - менее чувствительный и менее возбудимый, чем большинство людей.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 17,
        "ask" => "Меня раздражают люди, которые не могут быстро принимать решения.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Когда как",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 18,
        "ask" => "Иногда, хотя и кратковременно, у меня возникало чувство раздражения по отношению к моим родителям.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 19,
        "ask" => "Я скорее раскрыл бы свои сокровенные мысли:",
        "answers" => [
            [
                "say" => "Своим хорошим друзьям",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "В своем дневнике",
                "raw_point" => 0
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 20,
        "ask" => "Я думаю, что слово, противоположное по смыслу противоположности слова «неточный», - это:",
        "answers" => [
            [
                "say" => "Небрежный",
                "raw_point" => 0
            ],
            [
                "say" => "Тщательный",
                "raw_point" => 0
            ],
            [
                "say" => "Приблизительный",
                "raw_point" => 1
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 21,
        "ask" => "У меня всегда хватает энергии, когда мне это необходимо.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 22,
        "ask" => "Меня больше раздражают люди, которые:",
        "answers" => [
            [
                "say" => "Своими грубыми шутками вгоняют людей в краску",
                "raw_point" => 0
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Создают неудобства, когда опаздывают на условленную встречу со мной",
                "raw_point" => 2
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 23,
        "ask" => "Мне очень нравится приглашать к себе гостей и развлекать их.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 24,
        "ask" => "Я думаю, что:",
        "answers" => [
            [
                "say" => "Можно не все делать одинаково тщательно",
                "raw_point" => 0
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Любую работу следует выполнять тщательно, если вы за нее взялись",
                "raw_point" => 2
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 25,
        "ask" => "Мне обычно приходится преодолевать смущение.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 26,
        "ask" => "Мои друзья чаще:",
        "answers" => [
            [
                "say" => "Советуются со мной",
                "raw_point" => 2
            ],
            [
                "say" => "Делают то и другое",
                "raw_point" => 1
            ],
            [
                "say" => "Дают мне советы поровну",
                "raw_point" => 0
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 27,
        "ask" => "Если приятель обманывает меня в мелочах, я скорее предпочту сделать вид, что не заметил этого, чем разоблачу его.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 28,
        "ask" => "Я предпочитаю друзей:",
        "answers" => [
            [
                "say" => "Интересы которых имеют деловой и практический характер",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Которые отличаются философским взглядом на жизнь",
                "raw_point" => 2
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 29,
        "ask" => "Не могу равнодушно слушать, как другие люди высказывают идеи, противоположные тем, в которые я твердо верю.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 30,
        "ask" => "Меня волнуют мои прошлые поступки и ошибки.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 31,
        "ask" => "Если бы я одинаково хорошо умел делать и то и другое, я бы предпочел:",
        "answers" => [
            [
                "say" => "Играть в шахматы",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Играть в городки",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 32,
        "ask" => "Мне нравятся общительные, компанейские люди.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 33,
        "ask" => "Я настолько осторожен и практичен, что со мной случается меньше неприятных неожиданностей, чем с другими людьми.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 34,
        "ask" => "Я могу забыть о своих заботах и обязанностях, когда мне это необходимо.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 35,
        "ask" => "Мне бывает трудно признать, что я не прав.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 36,
        "ask" => "На предприятии мне было бы интереснее:",
        "answers" => [
            [
                "say" => "Работать с машинами и механизмами и участвовать в основном производстве",
                "raw_point" => 0
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Беседовать с людьми, занимаясь общественной работой",
                "raw_point" => 2
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 37,
        "ask" => "Какое слово не связано с двумя другими?",
        "answers" => [
            [
                "say" => "Кошка",
                "raw_point" => 0
            ],
            [
                "say" => "Близко",
                "raw_point" => 1
            ],
            [
                "say" => "Солнце",
                "raw_point" => 0
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 38,
        "ask" => "То, что в некоторой степени отвлекает мое внимание:",
        "answers" => [
            [
                "say" => "Раздражает меня",
                "raw_point" => 0
            ],
            [
                "say" => "Нечто среднее",
                "raw_point" => 1
            ],
            [
                "say" => "Не беспокоит меня совершенно",
                "raw_point" => 2
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 39,
        "ask" => "Если бы у меня было много денег, то я:",
        "answers" => [
            [
                "say" => "Жил бы, не стесняя себя ни в чем",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Позаботился бы о том, чтобы не вызывать к себе зависти",
                "raw_point" => 2
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 40,
        "ask" => "Худшее наказание для меня:",
        "answers" => [
            [
                "say" => "Тяжелая работа",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Быть запертым в одиночестве",
                "raw_point" => 2
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 41,
        "ask" => "Люди должны больше, чем сейчас, соблюдать нравственные нормы.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 42,
        "ask" => "Мне говорили, что ребенком я был:",
        "answers" => [
            [
                "say" => "Спокойным и любил оставаться один",
                "raw_point" => 0
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Живым и подвижным и меня нельзя было оставить одного",
                "raw_point" => 2
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 43,
        "ask" => "Я предпочел бы работать с приборами.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 44,
        "ask" => "Думаю, что большинство свидетелей на суде говорят правду, даже если это нелегко для них.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 45,
        "ask" => "Иногда я не решаюсь проводить в жизнь свои идеи, потому что они кажутся мне неосуществимыми.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 46,
        "ask" => "Я стараюсь смеяться над шутками не так громко, как большинство людей.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 47,
        "ask" => "Я никогда не чувствовал себя таким несчастным, чтобы хотелось плакать.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 48,
        "ask" => "Мне больше нравится:",
        "answers" => [
            [
                "say" => "Марш в исполнении духового оркестра",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Фортепианная музыка",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 49,
        "ask" => "Я предпочел бы провести отпуск:",
        "answers" => [
            [
                "say" => "В деревне с одним или двумя друзьями",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Возглавляя группу в туристском лагере",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 50,
        "ask" => "Усилия, затраченные на составление планов:",
        "answers" => [
            [
                "say" => "Никогда не лишни",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Не стоят этого",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 51,
        "ask" => "Необдуманные поступки и высказывания моих приятелей в мой адрес не обижают и не огорчают меня.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 52,
        "ask" => "Удавшиеся дела кажутся мне легкими.",
        "answers" => [
            [
                "say" => "Всегда",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Редко",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 53,
        "ask" => "Я предпочел бы работать:",
        "answers" => [
            [
                "say" => "В учреждении, где мне пришлось бы руководить людьми и все время быть среди них",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "В одиночестве, например архитектором, который разрабатывает свой проект",
                "raw_point" => 0
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 54,
        "ask" => "Дом относится к комнате, как дерево:",
        "answers" => [
            [
                "say" => "К лесу",
                "raw_point" => 0
            ],
            [
                "say" => "К растению",
                "raw_point" => 0
            ],
            [
                "say" => "К листу",
                "raw_point" => 1
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 55,
        "ask" => "То, что я делаю, у меня не получается:",
        "answers" => [
            [
                "say" => "Редко",
                "raw_point" => 2
            ],
            [
                "say" => "Время от времени",
                "raw_point" => 1
            ],
            [
                "say" => "Часто",
                "raw_point" => 0
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 56,
        "ask" => "В большинстве дел я предпочитаю:",
        "answers" => [
            [
                "say" => "Рискнуть",
                "raw_point" => 2
            ],
            [
                "say" => "Когда как",
                "raw_point" => 1
            ],
            [
                "say" => "Действовать наверняка",
                "raw_point" => 0
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 57,
        "ask" => "Вероятно, некоторые люди считают, что Я слишком много говорю.",
        "answers" => [
            [
                "say" => "Скорее всего, это так",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Думаю, что это не так",
                "raw_point" => 0
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 58,
        "ask" => "Мне больше нравится человек:",
        "answers" => [
            [
                "say" => "Большого ума, даже если он ненадежен и непостоянен",
                "raw_point" => 0
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Со средними способностями, но зато умеющий противостоять всяким соблазнам",
                "raw_point" => 2
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 59,
        "ask" => "Я принимаю решения:",
        "answers" => [
            [
                "say" => "Быстрее, чем многие люди",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Медленнее, чем большинство людей",
                "raw_point" => 0
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 60,
        "ask" => "На меня большое впечатление производят.",
        "answers" => [
            [
                "say" => "Мастерство и изящество",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Сила и мощь",
                "raw_point" => 0
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 61,
        "ask" => "Я считаю себя человеком, склонным к сотрудничеству.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 62,
        "ask" => "Мне больше нравится разговаривать с людьми изысканными, утонченными, чем с откровенными и прямолинейными.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 63,
        "ask" => "Я предпочитаю:",
        "answers" => [
            [
                "say" => "Сам решать вопросы касающиеся меня лично",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Советоваться с моими друзьями",
                "raw_point" => 0
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 64,
        "ask" => "Если человек не отвечает на мои слова, то я чувствую, что, должно быть, сказал какую-нибудь глупость.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 65,
        "ask" => "В школьные годы я больше всего получил знаний:",
        "answers" => [
            [
                "say" => "На уроках",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Читая книги",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 66,
        "ask" => "Я избегаю общественной работы и связанной с этим ответственности.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 67,
        "ask" => "Если очень трудный вопрос требует от меня больших усилий, то я:",
        "answers" => [
            [
                "say" => "Начну заниматься другим вопросом",
                "raw_point" => 0
            ],
            [
                "say" => "Затрудняюсь сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Еще раз попытаюсь решить этот вопрос",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 68,
        "ask" => "У меня возникают сильные эмоции: тревога, гнев, приступы смеха и т. д., - казалось бы, без определенных причин.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 69,
        "ask" => "Иногда я соображаю хуже, чем обычно.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 70,
        "ask" => "Мне приятно сделать человеку одолжение, согласившись назначить встречу с ним на время, удобное для него, даже если это немного неудобно для меня.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 71,
        "ask" => "Я думаю, что правильное число, которое должно продолжить ряд 1, 2, 3, 6, 5, ... - это:",
        "answers" => [
            [
                "say" => "10",
                "raw_point" => 1
            ],
            [
                "say" => "5",
                "raw_point" => 0
            ],
            [
                "say" => "7",
                "raw_point" => 0
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 72,
        "ask" => "Иногда у меня бывают непродолжительные приступы тошноты и головокружения без определенной причины.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Очень редко",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 73,
        "ask" => "Я предпочитаю скорее отказаться от своего заказа, чем доставить официанту или официантке лишнее беспокойство.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 74,
        "ask" => "Я живу сегодняшним днем в большей степени, чем другие люди.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 75,
        "ask" => "На вечеринке мне нравится:",
        "answers" => [
            [
                "say" => "Принимать участие в интересной деловой беседе",
                "raw_point" => 2
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Отдыхать вместе со всеми",
                "raw_point" => 0
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 76,
        "ask" => "Я высказываю свое мнение независимо от того, кто меня слушает:",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 77,
        "ask" => "Если бы я мог перенестись в прошлое, я хотел бы встретиться с:",
        "answers" => [
            [
                "say" => "Ньютоном",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Шекспиром",
                "raw_point" => 2
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 78,
        "ask" => "Я вынужден удерживать себя от того, чтобы не улаживать чужие дела.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 79,
        "ask" => "Работая в магазине, я предпочел бы:",
        "answers" => [
            [
                "say" => "Оформлять витрины",
                "raw_point" => 2
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Быть кассиром",
                "raw_point" => 0
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 80,
        "ask" => "Если люди плохо думают обо мне, я не стараюсь переубедить их, а продолжаю поступать так, как считаю нужным.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 81,
        "ask" => "Если я вижу, что мой старый друг холоден со мной и избегает меня, я обычно:",
        "answers" => [
            [
                "say" => "Сразу же думаю: «У него плохое настроение»",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Начинаю думать о том, какой неверный поступок я совершил",
                "raw_point" => 2
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 82,
        "ask" => "Многие неприятности происходят из-за людей:",
        "answers" => [
            [
                "say" => "Которые стараются во все внести изменения, хотя уже существуют удовлетворительные способы решения этих вопросов",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Которые отвергают новые, многообещающие предложения",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 83,
        "ask" => "Я получаю большое удовольствие, рассказывая местные новости.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 84,
        "ask" => "Аккуратные, требовательные люди не уживаются со мной.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 85,
        "ask" => "Мне кажется, что я менее раздражителен, чем большинство людей.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 86,
        "ask" => "Я могу легче не считаться с другими людьми, чем они со мной.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 87,
        "ask" => "Бывает, что все утро я не хочу ни с кем разговаривать.",
        "answers" => [
            [
                "say" => "Часто",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Никогда",
                "raw_point" => 2
            ]
        ],
        "factor" => "A"
    ],
    [
        "id" => 88,
        "ask" => "Если стрелки часов встречаются ровно через каждые 65 минут, отмеренных по точным часам, то эти часы:",
        "answers" => [
            [
                "say" => "Отстают",
                "raw_point" => 0
            ],
            [
                "say" => "Идут правильно",
                "raw_point" => 0
            ],
            [
                "say" => "Спешат",
                "raw_point" => 1
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 89,
        "ask" => "Мне бывает скучно:",
        "answers" => [
            [
                "say" => "Часто",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Редко",
                "raw_point" => 2
            ]
        ],
        "factor" => "C"
    ],
    [
        "id" => 90,
        "ask" => "Люди говорят, что мне нравится все делать своим оригинальным способом.",
        "answers" => [
            [
                "say" => "Верно",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Неверно",
                "raw_point" => 0
            ]
        ],
        "factor" => "E"
    ],
    [
        "id" => 91,
        "ask" => "Я считаю, что нужно избегать излишних волнений, потому что они утомительны.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "F"
    ],
    [
        "id" => 92,
        "ask" => "Дома в свободное время я:",
        "answers" => [
            [
                "say" => "Отдыхаю от всех дел",
                "raw_point" => 0
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Занимаюсь интересными делами",
                "raw_point" => 2
            ]
        ],
        "factor" => "G"
    ],
    [
        "id" => 93,
        "ask" => "Я осторожно отношусь к завязыванию дружеских отношений с незнакомыми людьми.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "H"
    ],
    [
        "id" => 94,
        "ask" => "Я считаю, что то, что люди говорят стихами, можно так же точно выразить прозой.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Затрудняюсь ответить",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "I"
    ],
    [
        "id" => 95,
        "ask" => "Мне кажется, что люди, с которыми я нахожусь в дружеских отношениях, могут оказаться отнюдь не друзьями за моей спиной.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "L"
    ],
    [
        "id" => 96,
        "ask" => "Мне кажется, что самые драматические события уже через год не оставят в моей душе никаких следов.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "M"
    ],
    [
        "id" => 97,
        "ask" => "Я думаю, что интереснее:",
        "answers" => [
            [
                "say" => "Работать с растениями",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Быть страховым агентом",
                "raw_point" => 2
            ]
        ],
        "factor" => "N"
    ],
    [
        "id" => 98,
        "ask" => "Я подвержен суевериям и беспричинному страху по отношению к некоторым вещам, например, к определенным животным, местам, датам и т.д.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "O"
    ],
    [
        "id" => 99,
        "ask" => "Я люблю размышлять о том, как можно было бы улучшить мир.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Трудно сказать",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q1"
    ],
    [
        "id" => 100,
        "ask" => "Я предпочитаю игры:",
        "answers" => [
            [
                "say" => "Где надо играть в команде или иметь партнера",
                "raw_point" => 0
            ],
            [
                "say" => "Не знаю",
                "raw_point" => 1
            ],
            [
                "say" => "Где каждый играет за себя",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q2"
    ],
    [
        "id" => 101,
        "ask" => "Ночью мне снятся фантастические и нелепые сны.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "Q3"
    ],
    [
        "id" => 102,
        "ask" => "Если я остаюсь в доме один, то через некоторое время ощущаю тревогу и страх.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 2
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 0
            ]
        ],
        "factor" => "Q4"
    ],
    [
        "id" => 103,
        "ask" => "Я могу своим дружеским отношением ввести людей в заблуждение, хотя на самом деле они мне не нравятся.",
        "answers" => [
            [
                "say" => "Да",
                "raw_point" => 0
            ],
            [
                "say" => "Иногда",
                "raw_point" => 1
            ],
            [
                "say" => "Нет",
                "raw_point" => 2
            ]
        ],
        "factor" => "MD"
    ],
    [
        "id" => 104,
        "ask" => "Какое слово не относится к двум другим?",
        "answers" => [
            [
                "say" => "Думать",
                "raw_point" => 1
            ],
            [
                "say" => "Видеть",
                "raw_point" => 0
            ],
            [
                "say" => "Слышать",
                "raw_point" => 0
            ]
        ],
        "factor" => "B"
    ],
    [
        "id" => 105,
        "ask" => "Если мать Марии является сестрой отца Александра, то кем является Александр по отношению к отцу Марии?",
        "answers" => [
            [
                "say" => "Двоюродным братом",
                "raw_point" => 0
            ],
            [
                "say" => "Племянником",
                "raw_point" => 1
            ],
            [
                "say" => "Дядей",
                "raw_point" => 0
            ]
        ],
        "factor" => "B"
    ]
];
