<script>
import PersonalTestingLayout from '@/Layouts/PersonalTestingLayout.vue';
import {Head} from "@inertiajs/vue3";
import GuestLayout from "@/Layouts/GuestLayout.vue";

export default {
    components: {Head},
    layout: GuestLayout
}
</script>

<template>

    <Head title="Конфиденциальность"></Head>

    <section class="w-screen h-screen p-4 ">
        <h1 class="px-10 pb-14 text-2xl text-center font-bold text-red-800 ml-20">Положение о конфиденциальности</h1>
        <div class="flex flex-col gap-2 ml-10">
            <details>
                <summary>Общее</summary>
                <div>
                    <p>Настоящая информация и описанные положения (далее Положение) в полном объеме распространяются на
                        обработку компанией ООО "НТЛ Упаковка" (далее - Компания) персональных данных при выполнении
                        сотрудниками
                        Компании или соискателями анкетирования и/или тестирования. </p>

                    <p>Соблюдение конфиденциальности важно для Компании, целью данного Положения является обеспечение
                        защиты
                        прав и свобод граждан при обработке их персональных данных от несанкционированного доступа и
                        разглашения, в том числе защиты прав на неприкосновенность частной жизни.
                        Настоящее Положение описывает, как Компания осуществляет обработку персональных данных, которая
                        включает в себя любые действия (операции), совершаемые с персональными данными, включая сбор,
                        запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение,
                        использование, передачу (распространение, предоставление, доступ), блокирование, уничтожение
                        персональных данных.
                        Отношения, связанные с обработкой персональных данных пользователей, проходящих анкетирование и
                        тестирование (далее - "Пользователь"), регулируются Положением, локальными актами Компании и
                        действующим законодательством
                        РФ.
                    </p>

                    <p>Под персональными данными понимается любая информация, относящаяся прямо или косвенно к
                        физическому
                        лицу (субъекту персональных данных) и которая может быть использована для идентификации данного
                        лица
                        либо связи с ним (далее — «Данные»/ «персональные данные»).
                    </p>

                    <p>Обработка персональных данных осуществляется Компанией на основе основополагающих принципов:</p>

                    <ol class="list-disc ml-14 py-1">
                        <li>законности и справедливости;</li>
                        <li>ограничение обработки достижением конкретных, заранее определенных и законных целей;
                        </li>
                        <li>обработке подлежат только персональные данные, которые отвечают целям их обработки;</li>
                        <li>соответствия объема и содержания обрабатываемых персональных данных заявленным целям
                            обработки;
                        </li>
                        <li>обеспечение точности, достаточности и актуальности персональных данных;</li>
                        <li>недопущение обработки персональных данных по достижении целей их обработки или в случае
                            утраты
                        </li>
                        <li>необходимости в достижении этих целей.</li>
                    </ol>


                    <p>Положение распространяется на обработку персональных данных, собранных посредством прохождения
                        Пользователем
                        анкетирования и тестирования, в том числе как
                        соискателя на вакансии Компании и как сотрудника Компании, проходящего профессиональное
                        обучение,
                        либо подтверждающего профессиональную категорию.
                    </p>
                </div>
            </details>
            <hr class="w-6/12">

            <details>
                <summary>Сбор персональных данных</summary>
                <div>
                    <p>Обработка персональных данных Пользователей осуществляется с их согласия. Пользователи свободно,
                        своей волей и в своем интересе предоставляют данные Компании.</p>

                    <p>Компания может запросить у Пользователя персональные данные в любой момент, когда тот проходит
                        тестирование
                        и/или анкетирование.
                        В каждом случае Пользователь предоставляет свои данные исключительно на добровольной основе,
                        самостоятельно
                        определяя необходимый объем предоставляемой информации. Компания не проверяет полученные
                        персональные
                        данные на достоверность и не несет ответственность за случаи неправомерного использования
                        Пользователями чужих персональных данных.
                    </p>

                    <p>В случае, если Ваши данные были незаконно
                        использованы,
                        просьба сообщить нам о данных фактах незамедлительно с целью предотвращения противоправных
                        действий.
                    </p>

                    <p>При прохождении тестирования Пользователь уведомляется о необходимости ознакомления с Положением.
                        Прохождение тестирования и/или анкетирования Пользователями, не предоставившими согласие на
                        обработку
                        персональных данных, не допускается.</p>

                    <p>Мы можем собирать следующие данные в отношении Пользователей, проходящих тестирование и
                        анкетирование:</p>
                    <ol class="list-disc ml-14 italic py-1">
                        <li>имя, отчество и фамилию;</li>
                        <li>дату рождения, место рождения, пол;</li>
                        <li>гражданство;</li>
                        <li>семейное положение;</li>
                        <li>адрес места регистрации;</li>
                        <li>адрес проживания;</li>
                        <li>паспортные данные;</li>
                        <li>номер контактного телефона;</li>
                        <li>сведения об образовании, квалификации, наличии специальных знаний;</li>
                        <li>сведения о дополнительном образовании, повышении квалификации;</li>
                        <li>сведения о трудовом стаже работы;</li>
                        <li>сведения о предыдущих местах работы и должностях;</li>
                        <li>сведения, указанные в предложении о работе;</li>
                        <li>наличие судимостей;</li>
                        <li>фотография;</li>
                        <li>номер телефона, адрес электронной почты;</li>
                    </ol>

                    <p>Персональные данные Пользователей обрабатываются исключительно с целью рассмотрения и оценки
                        возможности заключения трудового договора, оценки профессиональных и деловых качеств,
                        а также включения в кадровый резерв Компании.</p>

                    <p>
                        При обработке персональных данных Компанией обеспечивается точность персональных данных, их
                        достаточность, а в необходимых случаях и актуальность по отношению к целям обработки
                        персональных
                        данных.
                    </p>
                </div>
            </details>
            <hr class="w-5/12">

            <details>
                <summary>Хранение персональных данных</summary>
                <p>Персональные данные Пользователей обрабатываются:</p>

                <ol class="list-disc ml-14 italic py-1">
                    <li>с использованием автоматизированных систем при использовании баз данных (далее БД) - в этом
                        случае такие БД расположены на территории Российской Федерации
                    </li>
                    <li>с использованием автоматизированных систем без использованя БД или без использования таких
                        средств,
                        в случае, когда неавтоматизированная обработка персональных данных необходима в связи с
                        исполнением
                        требований законодательства.
                    </li>
                </ol>

            </details>
            <hr class="w-4/12">

            <details>
                <summary>Передача персональных данных</summary>
                <p>
                    Компания не предедает Данные третьим лицам. Однако Компании может быть необходимо, в соответствии с
                    законом или на основании запросов от
                    государственных
                    органов или суда, раскрыть Ваши персональные данные.</p>
            </details>
            <hr class="w-3/12">

            <details>
                <summary>Уничтожение персональных данных</summary>
                <div>
                    <p>Персональные данные Пользователя уничтожаются по истечении срока их обработки, либо при отзыве
                        субъектом персональных данных согласия на обработку персональных данных.
                        Сроки обработки персональных данных Пользователей, связанных с прохождением ими антетирования
                        и/или
                        тестирования составляют - бессрочно.
                    </p>

                    <p>Согласие на обработку персональных данных может быть отозвано пользователем, прошедшим
                        анкетирование
                        и/или тестирование на основании его письменного заявления.</p>
                    <p>Уничтожение персональных данных производится в течение сроков, установленных
                        законодательством.</p>
                </div>
            </details>
            <hr class="w-2/12">

            <details>
                <summary>Защита персональных данных</summary>
                <div>
                    <p>Компания предпринимает необходимые меры предосторожности, включая правовые, организационные,
                        административные и технические для обеспечения защиты Ваших персональных данных в соответствии
                        со
                        ст. 19 Федерального закона от 27.07.2006 N 152-ФЗ «О персональных данных» в целях обеспечения
                        защиты
                        от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования,
                        копирования,
                        распространения, а также других несанкционированных действий.</p>

                    <p>Принимая во внимание специфику сети Интернет, Компания не может гарантировать, что третьи лица не
                        смогут
                        обойти меры защиты, реализуемые Компанией, или использовать данные Пользователей в ненадлежащих
                        целях, поскольку данные действия могут не зависеть от принятых Компанией мер. В случае
                        возникновения
                        подобных инцидентов Компания в сроки, установленные законодательством, уведомит уполномоченный
                        орган
                        и проведет внутреннее расследование.</p>


                    <h3 class="ml-14 py-2 font-bold text-sm">ЦЕЛОСТНОСТЬ И СОХРАНЕНИЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h3>

                    <p>Взаимодействуя с Компанией, Вы можете легко поддерживать свои персональные данные и информацию в
                        актуальном состоянии. Мы будем хранить Ваши персональные данные и информацию в течение срока,
                        необходимого для выполнения целей, описываемых в настоящем Положении.</p>

                    <p>Для того чтобы убедиться, что Ваши персональные данные находятся в безопасности, мы доводим нормы
                        соблюдения конфиденциальности и безопасности до работников Компании и строго следим за
                        исполнением
                        мер соблюдения конфиденциальности внутри Компании.</p>


                    <h3 class="ml-14 py-2 font-bold text-sm">ОБРАЩЕНИЯ ПОЛЬЗОВАТЕЛЕЙ</h3>

                    <p>Если у вас возникнут вопросы в отношении Политики или обработки данных Компанией, Вы можете
                        связаться с нами по контактам для обратной связи. Контакты можно уточнить в отделе кадров
                        Компании.</p>

                    <p>Пользователи вправе направлять Компании любые запросы относительно использования персональных
                        данных, в том числе о внесении изменении в персональные данные, их удалении либо уничтожении,
                        путем
                        направления письменного обращения лично, либо заказным письмом по почте в адрес Компании.</p>

                    <p>Во всем остальном, что не отражено напрямую в Правилах, Компания обязуется руководствоваться
                        нормами
                        и положениями Федерального закона от 27.07.2006 N 152-ФЗ «О персональных данных».</p>


                    <h3 class="ml-14 py-2 font-bold text-sm">СОГЛАСИЕ НА ОБРАБОТКУ ДАННЫХ</h3>

                    <p>Пользователь, прошедший, либо проходящий тестирование и/или анкетирование, предоставляющий свои
                        персональные данные и информацию, тем самым соглашается с положениями данных правил
                        Конфиденциальности</p>
                </div>
            </details>
        </div>
    </section>
</template>

<style scoped>
summary {
    cursor: pointer;
    font-weight: 600;
    padding: 2px 5px;
}

summary::marker {
    font-size: 1.2em;
    color: darkred;
}

p {
    padding: 2px 150px 2px 10px;
    text-indent: 2rem;
}
</style>
